IOmsgData/simpl/shipper/getDeliveryStatusRequest.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:fut="http://futuremarket.ime.usp.br/">
   <soapenv:Header/>
   <soapenv:Body>
      <fut:getDeliveryStatus>
         <!--Optional:-->
         <arg0>
            <customerInfo>
               <endpoint/>
               <id/>
               <name/>
               <zipcode/>
            </customerInfo>
            <id>2</id>
            <products>product3</products>
            <sellerEndpoint>http://149.121.1.103:8080/supermarket3/supermarket3?wsdl</sellerEndpoint>
            <value>2.0</value>
         </arg0>
      </fut:getDeliveryStatus>
   </soapenv:Body>
</soapenv:Envelope>